# FabricationConnectorInfo Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationConnectorInfo Methods
FabricationConnectorInfo Class See Also
---
The FabricationConnectorInfo type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| HasDoubleWallConnector | Checks if there are any double wall connectors fabricated. |
| IsValid | Checks if the connector has fabrication parameters associated with it that can be set. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
FabricationConnectorInfo Class
Autodesk.Revit.DB Namespace